export default [
  {
    title: 'Iterator模式',
    summary:
      'Part1 ITerator模式 作用：循环不依赖具体的集合实现，扩展性比较好。 1.1 Iterator模式 使用Java语言显示数据arr中的元素时，我们可以使用下面的for循环语句遍历数组。 for (int i = 0; i < arr.length; i++) { System.out.p',
  },
  {
    title: 'Hugging Face 每周速递: ChatGPT API 怎么用？我们帮你搭好页面了',
    summary:
      '每一周，我们的同事都会向社区的成员们发布一些关于 Hugging Face 相关的更新，包括我们的产品和平台更新、社区活动、学习资源和内容更新、开源库和模型更新等，我们将其称之为「Hugging News」，本期 Hugging News 有哪些有趣的消息，快来看看吧！ 游戏与机器学习 🕹️ Ma ',
  },
  {
    title: '自己做一个ChatGPT微信小程序(代码开源)',
    summary:
      '离职在家 闲来无事看最近ChatGPT很火 花了一天时间 用Uniapp写了一个小程序端的ChatGPT,实在是看不惯~ 一大堆利用ChatGPT收费的应用(小程序) 整个开源的玩玩 另外主要是自己本身是后端开发人员~ 刚好用uniapp实践一下小程序开发 先看看主页面效果图吧 演示视频-> 做一个',
  },
  {
    title: '什么样的leader,是一个好leader!',
    summary:
      '首先，我不是替管理者说话，虽然我近些年大部分时间是都做的管理，但是我的代码职能一直没有放下。 10个人不到的团队，尤其是总是喜欢找应届生的公司，而且各种的1-2年的新人。 这种情况下，不写代码是不现实的，就是老板也是不会同意的。我骨子里面，还是认为自己是一个coder. 我是不是一个好的leader',
  },
  {
    title: '我的十年编程路 2015年篇',
    summary:
      '如果说2014是我编程之路狂飙的开始，那么2015年则是更加将其发扬光大。 2014年底，我获得了公司的先进奖，这在前一篇已经说过了。这个奖是我工作以来第一次获得的荣誉，所以格外珍惜。虽然有说法是这种奖，大家轮流得。但我还是很珍惜，以至于后来面试的简历上一直写着它。 有了这个奖的鼓励，2015年我就',
  },
  {
    title: 'K8S 实用工具之三 - 图形化 UI Lens',
    summary:
      '开篇 📜 引言： 磨刀不误砍柴工 工欲善其事必先利其器 第一篇：《K8S 实用工具之一 - 如何合并多个 kubeconfig？》 第二篇：《K8S 实用工具之二 - 终端 UI K9S》 像我这种，kubectl 用的不是非常溜，经常会碰到以下情况： 忘记命令，先敲 --help，再敲命令，效率',
  },
  {
    title: 'TCP与应用层协议',
    summary:
      '1、小故事与前言 最近返校做毕业设计，嵌入式和服务器需要敲定一个通信协议。 我问："服务端选什么协议，MQTT或者Websocket？" 他来句："TCP" 我又确认了一遍："用什么通信协议？" 他又来了句："TCP" 给我气笑了。最后在我的坚持下，他才勉强以他啥都能做，以我为准的理由妥协了。 简单',
  },
  {
    title: 'RabbitMQ真实生产故障问题还原与分析',
    summary:
      'RabbitMQ生产故障问题分析 由某一次真实生产环境rabbitMQ故障引发血案，下面复盘问题发生原因以及问题解决方法。 1、 问题引发 由某个服务BI-collector-xx队列出现阻塞，影响很整个rabbitMQ集群服务不可用，多个应用MQ生产者服务出现假死状态，系统影响面较广，业务影响很大',
  },
];
